//ADCDCID JOB 1,CHRIS,MSGCLASS=X,NOTIFY=ADCDC                           JOB00504
//BIND EXEC  PGM=IKJEFT01
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSTSIN  DD *
   DSN SYSTEM(DBCG) RETRY(5)
       BIND PACKAGE(mycollid)  -
       OWNER(tbc)              -
       QUALIFIER(tbc)          -
       MEMBER(ASMO313A)          -
       LIBRARY('SQM.TEST.PRD.DBRMLIB') -
       ACTION(REPLACE)              -
       EXPLAIN(YES)                 -
       VALIDATE(BIND)               -
       ISOLATION(CS)                -
       FLAG(I)                      -
       CURRENTDATA(NO)              -
       DEGREE(1)                    -
       RELEASE(COMMIT)              -
       ENABLE(*)                    -
       SQLERROR(NOPACKAGE)
//*
