//MIGSERV JOB 0,'ZPDT MIG',CLASS=A,MSGCLASS=X,NOTIFY=&SYSUID,
//     TIME=1440
//*
//MIGRATE  EXEC PGM=ZPDTMSRV,REGION=0M,PARM=3990
//STEPLIB  DD DISP=SHR,DSN=RBRANDL.ZOSSERV.LOADLIB
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSTCPD  DD DISP=SHR,DSN=ADCD.Z23B.TCPPARMS(PROF2)
//
