//ADCDCLD JOB 1,CHRIS,MSGCLASS=X,NOTIFY=&SYSUID
//****************************************************************
//*
//*         DB2 REBUILD INDEX UTILITY
//*
//****************************************************************
//UTIL EXEC DSNUPROC,SYSTEM=DBCG,UID='RBLDINDX',UTPROC=''
//*
//*  UTILITY WORK DATASETS
//*
//DSNUPROC.SORTWK01 DDUNIT=SYSDA,SPACE=(CYL,(2,1))
//DSNUPROC.SORTWK02 DDUNIT=SYSDA,SPACE=(CYL,(2,1))
//DSNUPROC.SYSUT1 DD DSN=&&SYSUT1,
//        UNIT=SYSDA,SPACE=(CYL,(2,1)),DCB=BUFNO=20
//DSNUPROC.UTPRINT DD SYSOUT=*
//*
//DSNUPROC.SYSIN    DD  *
  REBUILD INDEX (TST.ASM030XP)
  REBUILD INDEX (TST.ASM030X1)
  REBUILD INDEX (TST.ASM030X6)
  REBUILD INDEX (TST.ASM810XP)
  REBUILD INDEX (TST.ASM810X1)
  REBUILD INDEX (TST.ASM800XP)
  REBUILD INDEX (TST.ASM090E1)
  REBUILD INDEX (TST.ASM090XP)
  REBUILD INDEX (TST.ASM090X1)
  REBUILD INDEX (TST.ASM090X2)
  REBUILD INDEX (TST.ASM090X3)
  REBUILD INDEX (TST.ASM090X4)
  REBUILD INDEX (TST.ASM090X5)
  REBUILD INDEX (TST.ASM090X6)
  REBUILD INDEX (TST.ASM090X7)
  REBUILD INDEX (TST.ASM240I1)
  REBUILD INDEX (TST.ASM240I2)
  REBUILD INDEX (TST.ASM240I3)
  REBUILD INDEX (TST.ASM240U1)
  REBUILD INDEX (TST.ASM750XC)
  REBUILD INDEX (TST.ASM010XP)
  REBUILD INDEX (TST.ASM010X1)
  REBUILD INDEX (TST.ASM010X2)
  REBUILD INDEX (TST.ASM010X3)
  REBUILD INDEX (TST.ASM010X4)
  REBUILD INDEX (TST.ASM010X5)
  REBUILD INDEX (TST.ASM010X6)
  REBUILD INDEX (TST.CFI170XP)
  REBUILD INDEX (TST.CFI170X1)
  REBUILD INDEX (TST.CFI160XP)
  REBUILD INDEX (TST.CFI160X1)
  REBUILD INDEX (TST.CFI160X2)
  REBUILD INDEX (TST.CFI160X3)
  REBUILD INDEX (TST.CFI160X4)
  REBUILD INDEX (TST.CFI160X5)
/*
//

//*--REBUILD INDEX (TST.ASM030A1)
//*REBUILD INDEX (DSN8810.XPROJ2)
//*  REBUILD INDEX (DSN8810.XEMP1) DSNUM 3
//*  REBUILD INDEX (ALL) TABLESPACE DSN8D81A.DSN8S81C
