//ADCDCID JOB 1,CHRIS,MSGCLASS=X,NOTIFY=&SYSUID                         JOB00504
//*
//STEP1  EXEC PGM=IEFBR14
//SYSPRINT  DD SYSOUT=*
//ALLOC    EXEC PGM=IEFBR14
//XXXXXX   DD DSN=ADCDC.MY.TRY,DISP=(NEW,CATLG,CATLG),
//            LRECL=500,
//            SPACE=(TRK,(1,1)),UNIT=/0AA6
//*
