//ADCDCID JOB 1,CHRIS,MSGCLASS=X NOTIFY=ADCDC                           JOB00504
//*
//STEP1  EXEC PGM=IDCAMS
//SYSPRINT  DD SYSOUT=*
//SYSIN    DD *
   ALTER 'DSNCC10.DSNDBC.DSNDB06.SYSTSISS.I0001.A001' -
            NEWNM('DSNCC10.DSNDBC.DSNDB06.SYSTSISS.I0001.A001.X')
/*
//*
