//ADCDCRP JOB 1,CHRIS,MSGCLASS=X,NOTIFY=IBMUSER                         JOB00504
//REPAIR   EXEC DSNUPROC,REGION=0M,COND=(4,LT),
//            SYSTEM='DBCG',UID='DP0017.REPAIR0',UTPROC=''
//STEPLIB DD DSN=DSNC10.SDSNLOAD,DISP=SHR
//SYSPRINT DD SYSOUT=*
//UTPRINT  DD SYSOUT=*
//SYSIN    DD *
  REPAIR SET TABLESPACE NTPOC.ASMRLGLR NOCOPYPEND
//

  REPAIR SET TABLESPACE NTPOC.ASMRLGLR NOCOPYPEND
