//ADCDCEC JOB 1,CHRIS,MSGCLASS=X,NOTIFY=&SYSUID
//*       EXEC PGM=ISFAFD       'ISFAFD
//*ISFOUT DD SYSOUT=*
//*ISFIN  DD *
//*
//* SET CONFIRM OFF
//*
//*
//* O
//*
//* FIND 'XXXXXX'
//*
//* ++S
//* RESET
//*
//* FILTER COLUMN OPER VALUE - LIMIT JOBS SHOWN BASED ON ANY COLUMN
//* FIND JOBNAME - SEARCH FOR A JOB NAME
//* SELECT JOBNAME JOBID - TEMPORARILY LIMIT JOBS BY JOBNAME JOBID
//* SET DISPLAY - SHOW SETTINGS FOR PREFIX, DEST, SORT, ETC.
//* SNAP - TAKE A SNAPSHOT OF THE PANEL
//* SORT COLUMN-TITLE OR PLACE THE CURSOR ON THE TITLE AND PRESS ENTER
//*
//* WHEN ENTERING MULTIPLE FILTERS, YOU CAN SPECIFY AND OR OR TO DEFINE
//* THE RELATIONSHIP BETWEEN FILTERS.
//*
//*
//*
//*
//       EXEC PGM=SDSF,PARM='++32,1000'   'SDSF2 ',PARM='SERVER(SDSFT)'
//ISFOUT DD SYSOUT=*
//ISFIN  DD *
O
FIND 'SYSLOG'
++S
RESET
