//ADCDCRU JOB 1,CHRIS,MSGCLASS=X,NOTIFY=&SYSUID                         JOB00504
//STEP1    EXEC DSNUPROC,UID='XXXDBTST.RUNSTAT',TIME=1440,
//         UTPROC='',
//         SYSTEM='DBCG'
//UTPRINT  DD  SYSOUT=*
//SYSIN    DD *
RUNSTATS TABLESPACE ASMDBTST.ASM010TS TABLE(ALL)
RUNSTATS TABLESPACE ASMDBTST.ASM030TS TABLE(ALL)
RUNSTATS TABLESPACE ASMDBTST.ASM090TS TABLE(ALL)
RUNSTATS TABLESPACE ASMDBTST.ASM240TS TABLE(ALL)
RUNSTATS TABLESPACE ASMDBTST.ASM750TS TABLE(ALL)
RUNSTATS TABLESPACE ASMDBTST.ASM800TS TABLE(ALL)
RUNSTATS TABLESPACE ASMDBTST.ASM810TS TABLE(ALL)
RUNSTATS TABLESPACE CFIDBTST.CFI160TS TABLE(ALL)
RUNSTATS TABLESPACE CFIDBTST.CFI170TS TABLE(ALL)
/*
//
