//UNTERSEQ JOB (,),REGION=0M,NOTIFY=&SYSUID,CLASS=A
//****************************************************
//UNTERSEQ EXEC PGM=TRSMAIN,PARM=UNPACK
//SYSPRINT DD SYSOUT=*
//INFILE  DD DISP=SHR,DSN=POPUP.D.CORR.TERSED
//OUTFILE  DD DSN=POPUP.X.CORR.REXX.UNTERSED,
//            DISP=(NEW,CATLG),
//            SPACE=(CYL,(1,1,10))
